STRINGS = {
    1: """⎊ ** شكراً لتنصيبك سورس زد إي **
⎊ في الاسفل بعض الخيارات
⎊ التي ستساعدك في زد إي""",
    2: """🎉** حول زد إي**
🧿 زد إي هو يوزربوت في مكتبة التيليثون تم صنعه بأستخدام البايثون. يحتوي على اكثر من 100 أمر تساعدك في التليجرام و زد إي هو افضل سورس من ناحية الامان.
🔱 قناة السورس **@EE_20**""",
    3: """**💡• قنوات السورس •**
قـــنـاة الـسورس : @UI_XB 
جروب المساعده : @UI_OS
قــنـاة الـكـلايـش : @II_7_I 
قـنـاة الشروحات : @UI3I3
مـطـور الـسورس : @UP_UO""",
    4: f"""• `لمعرفة جميع اوامر السورس ارسل`
  - `.اوامري`
  - `.الاوامر`""",
    5: """⎊ **لأي مساعدة ثانية **
⎊ **أنضم في مجموعة المساعدة **
➥ **@UI_OS**.
⎊ **شكرا لك لقرائتك هذه المقالة**""",
}
