import asyncio
import random

MALATH = [
    """
‏﴿وَمَا كَانَ اللَّهُ لِيُعْجِزَهُ مِن شَيْءٍ﴾ .💙
""",
    """
( إِنَّ المُتَّقينَ في جَنَّاتٍ وَنَهَرٍ ۝ في مَقعَدِ صِدقٍ عِندَ مَليكٍ مُقتَدِرٍ ")💙
""",
    """
‏{لَقَدْ كُنْتَ فِي غَفْلَةٍ مِنْ هَذَا فَكَشَفْنَا عَنْكَ غِطَاءَكَ فَبَصَرُكَ الْيَوْمَ حَدِيدٌ}.💙
""",
    """
(قُلْ هُوَ اللَّـهُ أَحَدٌ*اللَّـهُ الصَّمَدُ*لَمْ يَلِدْ وَلَمْ يُولَدْ*وَلَمْ يَكُن لَّهُ كُفُوًا أَحَدٌ). 💙
""",
    """
‏﴿لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا ۚ لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ﴾💙
""",
    """
{وَمَاَ كَاَنَ اللهُ مُعَذّبَهُمْ وَهُمْ يَسْتَغْفِرُونَ} 💙 .
""",
    """
(الْحَمْدُ لِلَّهِ الَّذِي أَنْزَلَ عَلَىٰ عَبْدِهِ الْكِتَابَ وَلَمْ يَجْعَلْ لَهُ عِوَجًا)💙
""",
    """
﴿ نُصيبُ بِرَحمَتِنا مَن نَشاءُ وَلا نُضيعُ أَجرَ المُحسِنينَ ﴾💙
""",
    """
وَمَا كَانَ رَبُّكَ نَسِيًّا .💙
""",
    """
(‏فَاصْبِرْ إِنَّ وَعْدَ اللَّهِ حَقٌّ ۖ)💙
""",
    """
{ اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَن ذَا الَّذِي يَشْفَعُ عِندَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ } .💙
""",
    """
‏﴿ وَالصُّبْحِ إِذَا تَنَفَّسَ ﴾.💙
""",
    """
﴿أَقِمِ الصَّلاةَ لِدُلُوكِ الشَّمْسِ إِلَى غَسَقِ اللَّيْلِ وَقُرْآنَ الْفَجْرِ إِنَّ قُرْآنَ الْفَجْرِ كَانَ مَشْهُودًا﴾ .💙
""",
    """
﴿ لَا تَقْنَطُوا مِنْ رَحْمَةِ اللَّهِ ۚ﴾ .💙
""",
    """
﴿وَتَرَىٰ كُلَّ أُمَّةࣲ جَاثِیَةࣰۚ كُلُّ أُمَّةࣲ تُدۡعَىٰۤ إِلَىٰ كِتَـٰبِهَا ٱلۡیَوۡمَ تُجۡزَوۡنَ مَا كُنتُمۡ تَعۡمَلُونَ﴾.💙
""",
    """
۞ إِنَّمَا يُوَفَّى الصَّابِرُونَ أَجْرَهُمْ بِغَيْرِ حِسَابٍ ۞💙
""",
    """
﴿ فَٱعۡفُ عَنۡهُمۡ وَٱصۡفَحۡۚ ﴾ 💙 .
""",
    """
‏وَقَلِيلٌ مِّنْ عِبَادِيَ الشَّكُورُ 💙 .
""",
    """
۞ فَصَبْرٌ جَمِيلٌ وَاللَّهُ الْمُسْتَعَانُ ۞💙
""",
    """
‏{وَاشْكُرُوا لِلَّهِ إِنْ كُنْتُمْ إِيَّاهُ تَعْبُدُونَ}.💙
""",
    """
وَلَقَدْ أَنْزَلْنَا إِلَيْكَ آيَاتٍ بَيِّنَاتٍ ۖ وَمَا يَكْفُرُ بِهَا إِلَّا الْفَاسِقُونَ 💙 .
""",
    """
﴿ ثُمَّ تَابَ عَلَيْهِمْ لِيَتُوبُوا ﴾. 💙
""",
    """
﴿وَإِنِّي لَغَفَّارٌ لِّمَن تَابَ وَآمَنَ وَعَمِلَ صَالِحًا ثُمَّ اهْتَدَىٰ﴾💙
""",
    """
[رَبَّنَا هَبْ لَنَا مِنْ أَزْوَاجِنَا وَذُرِّيَّاتِنَا قُرَّةَ أَعْيُنٍ وَاجْعَلْنَا لِلْمُتَّقِينَ إِمَامًا ].💙
""",
    """
‏{لَا إِلَهَ إِلَّا أَنْتَ سُبْحَانَكَ إِنِّي كُنْتُ مِنَ الظَّالِمِينَ} 💙 .
""",
    """
﴿وَقَضَيْنَا إِلَيْهِ ذَٰلِكَ الْأَمْرَ﴾ 💙 .
""",
    """
‏﴿يَا أَيُّهَا الَّذِينَ آمَنُوا صَلُّوا عَلَيْهِ وَسَلِّمُوا تَسْلِيمًا﴾💙
""",
    """
‏﴿رَبِّ إِنِّي ظَلَمْتُ نَفْسِي فَاغْفِرْ لِي﴾.💙
""",
    """
‏(وَبَشِّرِ الْمُؤْمِنِينَ بِأَنَّ لَهُم مِّنَ اللَّهِ فَضْلًا كَبِيرًا).💙
""",
    """
﴿أَقِمِ الصَّلاةَ لِدُلُوكِ الشَّمْسِ إِلَى غَسَقِ اللَّيْلِ وَقُرْآنَ الْفَجْرِ إِنَّ قُرْآنَ الْفَجْرِ كَانَ مَشْهُودًا﴾ .💙
""",
    """
﴿ أَتَعْجَبِينَ مِنْ أَمْرِ اللَّهِ ﴾ 💙 .
""",
    """
إِنَّا وَجَدۡنَٰهُ صَابِرًاۚ. 💙
""",
    """
‏﴿فَاحْكُمْ بَيْنَ النَّاسِ بِالْحَقِّ وَلَا تَتَّبِعِ الْهَوَىٰ فَيُضِلَّكَ عَنْ سَبِيلِ اللَّهِ﴾💙
""",
    """
‏﴿وَادْعُوهُ خَوْفًا وَطَمَعًا إِنَّ رَحْمَتَ اللَّهِ قَرِيبٌ مِنَ الْمُحْسِنِينَ﴾.💙
""",
    """
﴿ وَتَشْتَكي إِلَى اللَّهِ وَاللَّهُ يَسْمَعُ ﴾ 💙 .
""",
    """
‏إِنَّ رَبِّي قَرِيبٌ مُّجِيبٌ .💙
""",
    """
{ وَاذْكُرُوهُ كَمَا هَدَاكُمْ وَإِن كُنتُم مِّن قَبْلِهِ لَمِنَ الضَّالِّينَ }💙
""",
    """
( وَقَالُوا الْحَمْدُ لِلَّهِ الَّذِي أَذْهَبَ عَنَّا الْحَزَنَ ۖ إِنَّ رَبَّنَا لَغَفُورٌ شَكُورٌ )💙
""",
]

# SOURCE ZE @UI_XB 
# MODY @UP_UO 


@bot.on(admin_cmd(pattern="آيه نصيه"))
async def ics(ze):
    await ze.edit("**⌔∮ اهلا عزيزي يتم تجهيز آيه قصيره 🌺**")
    await asyncio.sleep(2)
    tosh = random.choice(MALATH)
    return await zel.edit(f"{tosh}")
