from .. import *


@ZE.ar_cmd(pattern="القران الكريم")
async def ae(event):
    await edit_or_reply(
        event,
        " سور القرآن الكريم 🌺\n\n1 `.سوره الفاتحة` \n2 `.سوره البقرة` \n3 `.سوره آل عمران` \n4 `.سوره النساء` \n5 `.سوره المائدة` \n6 `.سوره الأنعام` \n7 `.سوره الأعراف` \n8 `.سوره الأنفال` \n9 `.سوره التوبة` \n10 `.سوره يونس` \n11 `.سوره هود` \n12 `.سوره يوسف` \n13 `.سوره الرعد` \n14 `.سوره إبراهيم` \n15 `.سوره الحجر` \n16 `.سوره النحل` \n17 `.سوره الإسراء`\n18 `.سوره الكهف` \n19 `.سوره مريم` \n20 `.سوره طه` \n21 `.سوره الأنبياء` \n22 `.سوره الحج` \n23 `.سوره المؤمنون` \n24 `.سوره النور` \n25 `.سوره الفرقان` \n26 `.سوره الشعراء`\n27 `.سوره النمل` \n28 `.سوره القصص` \n29 `.سوره العنكبوت` \n30 `.سوره الروم` \n31 `.سوره لقمان` \n32 `.سوره السجدة` \n33 `.سوره الأحزاب` \n34 `.سوره سبأ` \n35 `.سوره فاطر` \n36 `.سوره يس` \n37 `.سوره الصافات` \n38 `.سوره ص` \n39 `.سوره الزمر` \n40 `.سوره غافر` \n41 `.سوره فصلت` \n42 `.سوره الشورى`\n43 `.سوره الزخرف`\n44 `.سوره الدخان`\n45 `.سوره الجاثية`\n46 `.سوره الأحقاف`\n47 `.سوره محمد`\n48 `.سوره الفتح` \n49 `.سوره الحجرات` \n50 `.سوره ق` \n51 `.سوره الذاريات` \n52 `.سوره الطور`\n53 `.سوره النجم` \n54 `.سوره القمر` \n55 `.سوره الرحمن` \n56 `.سوره الواقعة` \n57 `.سوره الحديد`\n58 `.سوره المجادلة`\n59 `.سوره الحشر` \n60 `.سوره الممتحنة` \n61 `.سوره الصف` \n62 `.سوره الجمعة` \n63 `.سوره المنافقون` \n64 `.سوره التغابن` \n65 `.سوره الطلاق` \n66 `.سوره التحريم` \n67 `.سوره الملك` \n68 `.سوره القلم` \n69 `.سوره الحاقة` \n70 `.سوره المعارج` \n71 `.سوره نوح` \n72 `.سوره الجن` \n73 `.سوره المزمل` \n74 `.سوره المدثر` \n75 `.سوره القيامة` \n76 `.سوره الإنسان` \n77 `.سوره المرسلات` \n78 `.سوره النبأ` \n79 `.سوره النازعات` \n80 `.سوره عبس` \n81 `.سوره التكوير` \n82 `.سوره الإنفطار` \n83 `.سوره المطففين` \n84 `.سوره الإنشقاق` \n85 `.سوره البروج`\n86 `.سوره الطارق` \n87 `.سوره الأعلى` \n88 `.سوره الغاشية`\n89 `.سوره الفجر`\n90 `.سوره البلد`\n91 `.سوره الشمس`\n92 `.سوره الليل`\n93 `.سوره الضحى`\n94 `.سوره الشرح`\n95 `.سوره التين`\n96 `.سوره العلق`\n97 `.سوره القدر`\n98 `.سوره البينة`\n99 `.سوره الزلزلة`\n100 `.سوره العاديات`\n101 `.سوره القارعة`\n102 `.سوره التكاثر`\n103 `.سوره العصر`\n104 `.سوره الهمزة`\n105 `.سوره الفيل`\n106 `.سوره قريش`\n107 `.سوره الماعون`\n108 `.سوره الكوثر`\n109 `.سوره الكافرون`\n110 `.سوره النصر`\n111 `.سوره المسد`\n112 `.سوره الإخلاص`\n113 `.سوره الفلق`\n114 `.سوره الناس`",
        link_preview=False,
    )


@ZE.ar_cmd(pattern="افلام مصرية")
async def hi(event):
    await edit_or_reply(
        event,
        "♤■■■■ 《 𝑺𝑶𝑼𝑹𝑪𝑬 𝒁𝑬 》 ■■■■♤\n\n⎊ **تيلثون زد إي الافلام**\n\n⎊ `.تاج` & `.البعبع` & `.بيت الروبي `\n⎊ `.هارلي` & `.تحت تهديد السلاح` & `.مستر اكس` \n⎊ `.خطة مازنجر` & `.هاشتاج جوزني` & `بعد الشر`\n⎊ `.أبن الحج احمد` & `.رمسيس باريس`\n⎊ `.جروب الماميز` & `.اشباح اوروبا` & `.العنكبوت`\n\n⎊ `.بحبك` & `.موسى` & `.العارف` &  `.عمهم`\n⎊ `.نبيل الجميل اخصائى تجميل`\n⎊ `.احمد نوتردام` & `.محمد حسين`\n⎊ `.اخي فوق الشجرة` & `.كيرة و الجن`\n⎊ `.الجريمة` & `.الفيل الازرق1`\n⎊ `.يوم 13` & `.شوجر دادي`\n\n♤■■■■ 《 𝑺𝑶𝑼𝑹𝑪𝑬 𝒁𝑬 》 ■■■■♤",
    ) 


@ZE.ar_cmd(pattern="مسرحيات مصرية")
async def hi(event):
    await edit_or_reply(
        event,
        "♤■■■■ 《 𝑺𝑶𝑼𝑹𝑪𝑬 𝒁𝑬 》 ■■■■♤\n\n⎊ **تيلثون زد إي المسرحيات**\n\n⎊ `.مدرسة المشاغبين` & `.العيال كبرت`\n⎊ `.مدرسة المشاغبين بالالوان` & `.حزمنى يا`\n⎊ `.الواد سيد الشغال` & `.سك على بناتك`\n⎊ `.بودي جارد` & `.المتزوجون` & `.المرجيحة`\n⎊ `.وجهة نظر` & `.اخويا هايص وانا لايص`\n\n⎊ `.مسرح مصر1` & `.مسرح مصر2`\n⎊ `.مسرح مصر3` & `.مسرح مصر4`\n⎊ `.مسرح مصر5` & `.مسرح مصر6`\n⎊ `.مسرح مصر7` & `.مسرح مصر8`\n⎊ `.مسرح مصر9` & `.مسرح مصر10`\n⎊ `.مسرح مصر11` & `.مسرح مصر12`\n⎊ `.مسرح مصر13` & `.مسرح مصر14`\n⎊ `.مسرح مصر15` & `.مسرح مصر16`\n⎊ `.مسرح مصر17` & `.مسرح مصر18`\n⎊ `.مسرح مصر19` & `.مسرح مصر20`\n⎊ `.مسرح مصر21` & `.مسرح مصر22`\n\n♤■■■■ 《 𝑺𝑶𝑼𝑹𝑪𝑬 𝒁𝑬 》 ■■■■♤",
    ) 


@ZE.ar_cmd(pattern="افلام مارفل")
async def hi(event):
    await edit_or_reply(
        event,
        "♤■■■■ 《 𝑺𝑶𝑼𝑹𝑪𝑬 𝒁𝑬 》 ■■■■♤\n\n⎊ `.Iron Man1` \n⎊ `.Iron Man2` \n⎊ `.Iron Man3` \n⎊ `.ZE man1` \n⎊ `.ZE man2` \n⎊ `.ZE man3` \n⎊ `.ZE Man Homecoming` \n⎊ `.ZE Man Far From Home` \n⎊ `.ZE Man No Way Home` \n⎊ `.The Amazing ZE Man1` \n⎊ `.The Amazing ZE Man2` \n⎊ `.Doctor Strange1` \n⎊ `.Doctor Strange2` \n⎊ `.Venom1` \n⎊ `.Venom2` \n⎊ `.Thor1` \n⎊ `.Thor2` \n⎊ `.Black panther1` \n⎊ `.Black panther2` \n⎊ `.Deadpool1` \n⎊ `.Deadpool2` \n⎊ `.Ant Man1` \n⎊ `.Ant Man2` \n⎊ `.Ant Man3` \n⎊ `.Captain America1` \n⎊ `.Captain America2` \n⎊ `.Captain America3` \n⎊ `.The Avengers` \n⎊ `.Avengers Infinity War` \n⎊ `.Avengers Endgame` \n⎊ `.Black Widow` \n⎊ `.Shang Chi` \n\n♤■■■■ 《 𝑺𝑶𝑼𝑹𝑪𝑬 𝒁𝑬 》 ■■■■♤",
    ) 


@ZE.ar_cmd(pattern="افلام اجنبية")
async def hi(event):
    await edit_or_reply(
        event,
        "♤■■■■ 《 𝑺𝑶𝑼𝑹𝑪𝑬 𝒁𝑬 》 ■■■■♤\n\n⎊ `.Avatar The Way of Water`  \n⎊ `.Tin and Tina` \n⎊ `.Evil dead rise` \n⎊ `.bull shark` \n⎊ `.Clock` \n⎊ `.From Black` \n⎊ `.Dinosaur world` \n⎊ `.The Tomorrow Job` \n⎊ `.Pillow Party Massacre` \n⎊ `.Aka` \n⎊ `.The Fearway` \n⎊ `.Breakout` \n⎊ `.Jesus Revolution` \n⎊ `.Dungeons Dragons` \n⎊ `.The Best Man` \n⎊ `.The Irish Mob` \n⎊ `.Sisu` \n⎊ `.Maid For Revenge` \n⎊ `.Polite Society` \n⎊ `.Homestead` \n\n♤■■■■ 《 𝑺𝑶𝑼𝑹𝑪𝑬 𝒁𝑬 》 ■■■■♤",
    ) 


@ZE.ar_cmd(pattern="التحديثات")
async def hi(event):
    await edit_or_reply(
        event,
        "♤■■■■ 《 𝑺𝑶𝑼𝑹𝑪𝑬 𝒁𝑬 》 ■■■■♤\n\n**⎊ قائمة اخر تحديثات سورس زد إي**\n⎊ تم تحديث الامر رقم 28 للأفلام\n⎊ تم تحديث الامر رقم 29 للقرآن الكريم \n⎊ لسماع اخر تحديثات زد إي اكتب `.ZE Updates`\n\n♤■■■■ 《 𝑺𝑶𝑼𝑹𝑪𝑬 𝒁𝑬 》 ■■■■♤",
    ) 